<?php
# arrays_loops_tasks: Завдання №17
#
# Складіть масив місяців. За допомогою циклу foreach виведіть всі місяці,
# а поточний місяць виведіть товстим. Поточний місяць повинен зберігатися 
# в зміній $month.

$arr = [
    'Січень',
    'Лютий',
    'Березень',
    'Квітень',
    'Травень',
    'Червень',
    'Липень',
    'Серпень',
    'Вересень',
    'Жовтень',
    'Листопад',
    'Грудень'
];

$month = 'Вересень';
foreach ($arr as $value) {
    if (!($value === $month)) {
        echo $value . "<br>\n";
    } else {
        echo "<b>" . $value . "</b><br>\n";
    }
}
