<?php
# functions_form_tasks: Завдання №11 
#
# Написати функцію, яка в якості аргумента приймає рядок, і форматує її таким чином, що кожне нове речення
# починалося з великої літери.
# Приклад:
# Вхідний рядок: 'а васька слушает да ест. а воз и ныне там. а вы друзья как ни садитесь, все в музыканты не годитесь.
# а король-то — голый. а ларчик просто открывался. а там хоть трава не расти.'.
# Рядок, повернутий функціею: 'А Васька слушает да ест. А воз и ныне там. А вы друзья как ни садитесь, все в музыканты 
# не годитесь. А король-то — голый. А ларчик просто открывался. А там хоть трава не расти.'.

function aper(string $str)
{
    $arr_str = array_filter(explode('.', $str));
    $res = '';
    foreach ($arr_str as $value) {
        $tmp = explode(' ', trim($value));
        foreach ($tmp as $key => $value) {
            $tmp[$key] = mb_strtoupper($value);
            break;
        }
        $res .= implode(' ', $tmp) . ". ";
    }
    echo $res;
}
