<?php
# functions_form_tasks: Завдання №13 
#
# Дано рядок $string = 'яблуко черешня вишня вишня черешня груша яблуко черешня вишня яблуко вишня вишня 
# черешня груша яблуко черешня черешня вишня яблуко вишня вишня черешня вишня черешня груша яблуко черешня 
# черешня вишня яблуко вишня вишня черешня черешня груша яблуко черешня вишня';
# 
# Подсчитайте, скільки раз кажен фрукт зустрічається в цьому рядку. Виведіть в вигляді списка в порядку зменшення кількості:
#
# Приклад виводу:
# яблоко – 12
# черешня – 8
# груша – 5
# слива - 3

$string = 'яблуко черешня вишня вишня черешня груша яблуко черешня вишня яблуко вишня вишня 
  черешня груша яблуко черешня черешня вишня яблуко вишня вишня черешня вишня черешня груша яблуко черешня 
  черешня вишня яблуко вишня вишня черешня черешня груша яблуко черешня вишня';

$string = str_replace(PHP_EOL, ' ', $string);
$arr = explode(' ', trim($string));
$unique = array_filter(array_unique($arr));
$unique = (array_chunk($unique, 1));

$res = [];

foreach ($unique as $key => $value) {
    $temp  = array_values(array_intersect($arr, $unique[$key]));
    $count = count($temp);
    $res[$temp[0]] = $count;
    arsort($res);
    $temp = [];
}

foreach ($res as $key => $value) {
    echo $key . ' - ' . $value . PHP_EOL;
}
